Revit 2026 API

# FilterStringBeginsWith Properties

---

The FilterStringBeginsWith type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterStringRuleEvaluator) |

#### Reference

FilterStringBeginsWith Class

Autodesk.Revit.DB Namespace